'use strict';
const co = require('co');
const mongoose = require('mongoose');
mongoose.Promise = global.Promise;

const FeedSourceCategory = require('./models/FeedSourceCategory');
const FeedSourceCategoryGroup = require('./models/FeedSourceCategoryGroup');

 const config = {
     mongo: 'mongodb://192.168.100.83:27017/boom',
     es: '192.168.100.83:9200'
 };

//const config = {
//   mongo: 'mongodb://boom:boom@dds-bp13d9353a884c541.mongodb.rds.aliyuncs.com:3717/boom',
//   es: '10.31.130.75:9200'
//};

co(function *() {
    mongoose.connect(config.mongo);


    let categories = {'科技': ['科技', '前沿技术', '行业技能', '人工智能', 'IT', '通信', 'TMT个人', 'IT资讯', 'APP', '苹果手机', '行业资讯', '前沿资讯', '产品评测', '研究单位', '科学', '科技新闻', '科研机构', '移动互联网', 'TMT', '互联网行业', '电子产品', '科研', '大数据', '手机资讯', '科技资讯', '黑科技', '3D', 'VI设计', '科技数码', '锤子科技'], '营销': ['阅读推广', '广告', 'TMT机构', 'KOL', '营销', '打折优惠', 'TMT个人', '电商平台', 'TMT', '企业营销', '新媒体营销', 'promote', '营销管理'], '设计': ['设计', '工业设计', '创意设计', '中国建筑设计院', '建筑设计', 'VI设计', 'logo设计', '包装设计', '室内设计', '家居设计', '平面设计', '日本设计', '景观设计', '服装设计', '画册设计', '装饰设计', '潮流', '视觉'], '创意':['广告', '新媒体', '潮生活', '创意', '创新', '原创分析', '创意设计', '原创视频', '新鲜事', '创意文案', '新奇特'], '时尚':['时尚', '穿搭', '购物', '明星', '服装', '潮生活', '高街潮牌', '轻奢', '奢侈', '时装周', '发型', '先锋时尚', '时尚穿搭', '服装业', '轻奢品', '头发', '女装', '时装', '时装秀', '服装搭配', '服饰搭配', '模特', '纹身', '时尚产业', '时尚博主', '时尚圈', '时尚搭配', '时尚资讯', '衣服', '鞋品', '鞋子', '鞋服', '鞋类', '韩流'], '美妆':['美妆', '化妆品', '美发', '美体', '瘦身', '美容', '美容护肤', '专业美容', '美容师', '美容手法', '美容知识', '美肤宝', '美容保养', '美白保湿', '美颜'], '文化':['艺术', '文化', '传统文化', '茶文化', '北京文化', '国学文化', '文化旅行', '文艺'], '美食':['美食', '餐饮', '吃喝玩乐', '食疗', '厨艺', '菜谱', '烹饪', '吃货', '快餐', '美食推荐', '食品', '做饭', '家常菜', '食评', '水果', '厨师', '杭州美食', '美食餐饮', '食材', '食谱', '饮食', '广州美食', '美食企业', '食物', '上饶美食', '健康美食', '全球美食', '原创美食', '太原美食', '山西美食', '广丰美食', '廊坊美食', '成都美食', '新疆美食', '武汉美食', '深圳美食', '生活美食', '美食探店', '美食故事', '美食视频', '美食资讯', '重庆美食'], '漫画':['漫画'], '汽车':['汽车', '汽车评测', '汽车资讯', '购车服务', '车企', '开车技巧', '汽车导购', '汽车养护', '爱车族', '汽车测评', '汽车后市场', '汽车知识', '车型对比', '摩托车', '购车指南', '汽车改装', '汽车教练', '买车', '汽车保养', '汽车新闻', '汽车视频', '车叔', '车改装', '学车', '新车', '购车', '车评人', '开车技巧', '汽车点评', '上饶汽车', '二手车', '养车', '广丰汽车', '打车', '新车上市', '新车导购', '机车', '汽车保险', '汽车干货', '汽车点评', '汽车维修', '汽车节目', '汽车评论', '汽车长测', '深度懂车', '潍坊车主', '玩车人群', '用车攻略', '豪车', '购车资讯', '赛车', '跑车', '车', '车主', '车友会', '车市', '车市评论', '车险', '车驾管信息', '轿车', '选车攻略', '预约审车', '驾车技巧'], '互联网':['互联网', '前沿技术', '人工智能', '互联网资讯', 'IT资讯', '软件开发', '产品评测', '互联网行业', '科研', '移动', '网易', '大数据', '互联网保险', '互联网新闻', '锤子手机', '门户', '黑科技', '3D', 'APP软件', 'H5', 'IE', '互联网业', '互联网安全', '互联网思维', '互联网科技', '小程序商店', '小程序资讯'], '摄影':['摄影', '照片集'], '游戏':['游戏', '手游', '手机游戏'], '旅行':['旅游', '旅行', '旅游网站', '旅行感悟', '自助游', '自驾游', '旅游文化', '旅游攻略', '游记', '旅行社', '亲子旅游', '文化旅行', '定制旅行', '旅游资讯', '旅行攻略', '旅行故事', '旅行纪录片', '旅行资讯', '旅评家', '硅谷旅游', '欧洲游', '游玩', '出游', '周边游'], '新闻':['资讯', '新闻评论', '报纸', '新闻', '媒体公知', '趣闻', '前沿资讯', '科技新闻', '新闻资讯', '时政评论', '行业新闻', '汽车新闻', '交通新闻', '当地新闻', '新闻时事', '互联网新闻', '海外新闻', '本地新闻', '娱乐新闻', '新闻动态', '头条新闻', '泰国新闻', '时事新闻', '时事热闻', '奇闻', '海外趣闻'], '商业':['企业', '商业', '商业服务', '企业家', '行业资讯', '企业管理', '商业地产', '商界', '企业运营', '企业案例', '商务', '商业服务'], '金融':['财经', '投资', '金融', '财富', '互联网金融', '银行', '股市', '理财', '经济', '股票', '股评', '消费金融', '信用卡', '财务', '财税', '财经媒体人', '财经评论', '专业理财', '投资理财', '金融业', '基金', '基金交易', '投融资', '投资机构', '财富管理', '资产管理', '金融服务', '金融证券'], '电影':['电影', '影音', '影视', '影评', '电影短片', '影视推荐', '影视音乐']};

    yield FeedSourceCategory.remove({});
    let index = Object.keys(categories).length;
    for (let name in categories) {
        yield new FeedSourceCategory({
            name: name,
            tags: categories[name],
            orderIndex: index --
        }).save();
    }

    let groups = {
        '创意/设计': ['设计', '创意', '文化', '时尚', '摄影' ],
        '文案／策划': ['营销','设计','创意','文化' ],
        '市场／营销': ['营销','新闻','商业','互联网' ],
        '运营／产品': ['科技','营销','互联网','新闻','商业','创意' ],
        '技术／开发': [ '科技','互联网','创意' ],
        '其他': [ '营销','设计','创意','时尚' ]
    };

    yield FeedSourceCategoryGroup.remove({});
    index = Object.keys(groups).length;

    for (let name in groups) {
        let categories = groups[name];
        let categoryMap = {};

        for (let i=0; i<categories.length; i++) {
            let category = categories[i];
            let fsc = yield FeedSourceCategory.findOne({ name: category });
            categoryMap[name] = [{ _id: fsc._id.toString(), name: category }, ...(categoryMap[name] || [])];
        }

        yield new FeedSourceCategoryGroup({
            name: name,
            categories: categoryMap[name],
            orderIndex: index --
        }).save();
    }

    mongoose.connection.close();
});